zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_trdc_soc.h
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _FSL_TRDC_SOC_H_
#define _FSL_TRDC_SOC_H_

#include "fsl_common.h"

/*!
 * @addtogroup trdc_soc
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @name Driver version */
/*@{*/
/*! @brief Driver version 2.0.0. */
#define FSL_TRDC_SOC_DRIVER_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

#define TRDC_MBC_BLK(trdcInst, mbcInst, slvIdx, blkIdx) ((blkIdx) | ((slvIdx) << 8U) | ((mbcInst) << 16U) | (trdcInst << 24U))
/*!@brief Gets which TRDC instance does this MBC block belongs to. */
#define TRDC_MBC_GetTRDCInst(mbcBlk) (((mbcBlk) >> 24U) & 0xFFU)
/*!@brief Gets which MBC index does this MBC block belongs to. */
#define TRDC_MBC_GetMBCIdx(mbcBlk) (((mbcBlk) >> 16U) & 0xFFU)
/*!@brief Gets which slave index does this MBC block belongs to. */
#define TRDC_MBC_GetSlvIdx(mbcBlk) (((mbcBlk) >> 8U) & 0xFFU)
/*!@brief Gets which memory block index does this MBC block belongs to. */
#define TRDC_MBC_GetBlkIdx(mbcBlk) ((mbcBlk) & 0xFFU)

/*!
 * @brief Enumeration for TRDC master mapping
 *
 * Defines the enumeration for TRDC master resource collections.
 */
typedef enum _trdc_master
{
    kTRDC_MAIN_MasterEDMA5Ch0_1    = 0U,
    kTRDC_MAIN_MasterEDMA5Ch2_3    = 1U,
    kTRDC_MAIN_MasterEDMA5Ch4_5    = 2U,
    kTRDC_MAIN_MasterEDMA5Ch6_7    = 3U,
    kTRDC_MAIN_MasterEDMA5Ch8_9    = 4U,
    kTRDC_MAIN_MasterEDMA5Ch10_11  = 5U,
    kTRDC_MAIN_MasterEDMA5Ch12_13  = 6U,
    kTRDC_MAIN_MasterEDMA5Ch14_15  = 7U,
    kTRDC_MAIN_MasterMEDMA3Ch0_1   = 8U,
    kTRDC_MAIN_MasterMEDMA3Ch2_3   = 9U,
    kTRDC_MAIN_MasterMEDMA3Ch4_5   = 10U,
    kTRDC_MAIN_MasterMEDMA3Ch6_7   = 11U,
    kTRDC_MAIN_MasterMEDMA3Ch8_9   = 12U,
    kTRDC_MAIN_MasterMEDMA3Ch10_11 = 13U,
    kTRDC_MAIN_MasterMEDMA3Ch12_13 = 14U,
    kTRDC_MAIN_MasterMEDMA3Ch14_15 = 15U,
    kTRDC_MAIN_MasterMEDMA3Ch16_17 = 16U,
    kTRDC_MAIN_MasterMEDMA3Ch18_19 = 17U,
    kTRDC_MAIN_MasterMEDMA3Ch20_21 = 18U,
    kTRDC_MAIN_MasterMEDMA3Ch22_23 = 19U,
    kTRDC_MAIN_MasterMEDMA3Ch24_25 = 20U,
    kTRDC_MAIN_MasterMEDMA3Ch26_27 = 21U,
    kTRDC_MAIN_MasterMEDMA3Ch28_29 = 22U,
    kTRDC_MAIN_MasterMEDMA3Ch30_31 = 23U,
    kTRDC_MAIN_MasterReserved0     = 24U,
    kTRDC_MAIN_MasterReserved1     = 25U,
    kTRDC_MAIN_MasterDAP_AHBP      = 26U,
    kTRDC_MAIN_MasterETR           = 27U,
    kTRDC_MAIN_MasterReserved2     = 28U,
    kTRDC_MAIN_MasterReserved3     = 29U,
    kTRDC_MAIN_MasterWAKE_SS       = 30U,
    kTRDC_MAIN_MasterReserved4     = 31U,
    kTRDC_MAIN_MasterMTR           = 32U,
    kTRDC_MAIN_MasterTESTPORT      = 33U,

    kTRDC_CMPT_MasterCPU0_AXIM = 0U,
    kTRDC_CMPT_MasterCPU0_AHBP = 1U,
    kTRDC_CMPT_MasterReserved0 = 2U,
    kTRDC_CMPT_MasterReserved1 = 3U,
    kTRDC_CMPT_MasterLLC_RD    = 4U,
    kTRDC_CMPT_MasterLLC_WR    = 5U,
    kTRDC_CMPT_MasterNPU       = 6U,

    kTRDC_WAKE_MasterWEDMA3Ch0_1 = 0U,
    kTRDC_WAKE_MasterWEDMA3Ch0_2 = 1U,
    kTRDC_WAKE_MasterWEDMA3Ch0_3 = 2U,
    kTRDC_WAKE_MasterWEDMA3Ch0_4 = 3U,

    kTRDC_AUDIO_MasterAEDMA3Ch0_1 = 0U,
    kTRDC_AUDIO_MasterAEDMA3Ch0_2 = 1U,
    kTRDC_AUDIO_MasterAEDMA3Ch0_3 = 2U,
    kTRDC_AUDIO_MasterAEDMA3Ch0_4 = 3U,

    kTRDC_COMM_MasterSDHC0     = 0U,
    kTRDC_COMM_MasterSDHC1     = 1U,
    kTRDC_COMM_MasterUSB0      = 2U,
    kTRDC_COMM_MasterUSB1      = 3U,
    kTRDC_COMM_MasterENET0     = 4U,
    kTRDC_COMM_MasterENET1_M0R = 5U,
    kTRDC_COMM_MasterENET1_M0T = 6U,
    kTRDC_COMM_MasterXSPI_RESP = 7U,

    kTRDC_MEDIA_MasterDCIFLayer0 = 0U,
    kTRDC_MEDIA_MasterDCIFLayer1 = 1U,
    kTRDC_MEDIA_MasterDCIFLayer2 = 2U,
    kTRDC_MEDIA_MasterDCIFLayer3 = 3U,
    kTRDC_MEDIA_MasterDCIFLayer4 = 4U,
    kTRDC_MEDIA_MasterDCIFLayer5 = 5U,
    kTRDC_MEDIA_MasterDCIFLayer6 = 6U,
    kTRDC_MEDIA_MasterDCIFLayer7 = 7U,
    kTRDC_MEDIA_MasterISI        = 8U,
    kTRDC_MEDIA_MasterISI_U      = 9U,
    kTRDC_MEDIA_MasterISI_V      = 10U,
    kTRDC_MEDIA_MasterCSI        = 11U,
    kTRDC_MEDIA_MasterGPU_DMA    = 12U,
    kTRDC_MEDIA_MasterGPU_CCD    = 13U,
    kTRDC_MEDIA_MasterJPEG       = 14U,
} trdc_master_t;

/*!
 * @brief Enumeration for TRDC MRC mapping
 *
 * Defines the enumeration for TRDC MRC (Memory Region Controller) mapping.
 */
typedef enum _trdc_mrc
{
    kTRDC_MAIN_MrcXSPI0     = 0U,
    kTRDC_MAIN_MrcXSPI1     = 1U,
    kTRDC_MAIN_MrcSRAMC     = 2U,

    kTRDC_CMPT_MrcSRAM0_1_2 = 0U,
    kTRDC_CMPT_MrcCPU0_TCM  = 1U,
    kTRDC_CMPT_MrcROM       = 2U,
    kTRDC_CMPT_MrcNPU_TCM   = 3U,
    kTRDC_CMPT_MrcLLC       = 4U,
} trdc_mrc_t;

/*!
 * @brief Enumeration for TRDC MBC mapping
 *
 * Defines the enumeration for TRDC MBC (Memory Blocker Checker) mapping.
 * User Can use @ref TRDC_MBC_GetTRDCInst, @ref TRDC_MBC_GetMBCInst,
 * @ref TRDC_MBC_GetSlvIdx and @ref TRDC_MBC_GetBlkIdx to get details
 * about each block.
 */
typedef enum _trdc_mbc_block {
    // CMPT_TRDC.MBC[0][0], trdcInst = 0, mbcInst = 0, slvIdx = 0
    kTRDC_CMPT_MBC_MODCON            = TRDC_MBC_BLK(0, 0, 0, 0),    /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 0 */
    kTRDC_CMPT_MBC_MTR               = TRDC_MBC_BLK(0, 0, 0, 2),    /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 2 */
    kTRDC_CMPT_MBC_TCU               = TRDC_MBC_BLK(0, 0, 0, 3),    /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 3 */
    kTRDC_CMPT_MBC_TRDC_MGR          = TRDC_MBC_BLK(0, 0, 0, 4),    /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 4 */
    kTRDC_CMPT_MBC_TRDC_MC           = TRDC_MBC_BLK(0, 0, 0, 5),    /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 5 */
    kTRDC_CMPT_MBC_CCM               = TRDC_MBC_BLK(0, 0, 0, 6),    /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 6 */
    kTRDC_CMPT_MBC_SRAMCTL0          = TRDC_MBC_BLK(0, 0, 0, 8),    /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 8 */
    kTRDC_CMPT_MBC_SRAMCTL1          = TRDC_MBC_BLK(0, 0, 0, 9),    /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 9 */
    kTRDC_CMPT_MBC_SRAMCTL2          = TRDC_MBC_BLK(0, 0, 0, 10),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 10 */
    kTRDC_CMPT_MBC_SRAMCTL3          = TRDC_MBC_BLK(0, 0, 0, 11),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 11 */
    kTRDC_CMPT_MBC_SRAMCTL4          = TRDC_MBC_BLK(0, 0, 0, 12),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 12 */
    kTRDC_CMPT_MBC_SRAMCTL5          = TRDC_MBC_BLK(0, 0, 0, 13),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 13 */
    kTRDC_CMPT_MBC_SRAMCTL6          = TRDC_MBC_BLK(0, 0, 0, 14),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 14 */
    kTRDC_CMPT_MBC_SRAMCTL7          = TRDC_MBC_BLK(0, 0, 0, 15),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 15 */
    kTRDC_CMPT_MBC_SRAMCTL8          = TRDC_MBC_BLK(0, 0, 0, 16),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 16 */
    kTRDC_CMPT_MBC_SRAMCTL9          = TRDC_MBC_BLK(0, 0, 0, 17),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 17 */
    kTRDC_CMPT_MBC_SRAMCTL10         = TRDC_MBC_BLK(0, 0, 0, 18),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 18 */
    kTRDC_CMPT_MBC_SRAMCTL11         = TRDC_MBC_BLK(0, 0, 0, 19),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 19 */
    kTRDC_CMPT_MBC_SRAMCTL12         = TRDC_MBC_BLK(0, 0, 0, 20),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 20 */
    kTRDC_CMPT_MBC_SRAMCTL13         = TRDC_MBC_BLK(0, 0, 0, 21),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 21 */
    kTRDC_CMPT_MBC_SRAMCTL14         = TRDC_MBC_BLK(0, 0, 0, 22),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 22 */
    kTRDC_CMPT_MBC_SRAMCTL15         = TRDC_MBC_BLK(0, 0, 0, 23),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 23 */
    kTRDC_CMPT_MBC_LLC               = TRDC_MBC_BLK(0, 0, 0, 26),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 26 */
    kTRDC_CMPT_MBC_ROMCP             = TRDC_MBC_BLK(0, 0, 0, 27),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 27 */
    kTRDC_CMPT_MBC_NPU               = TRDC_MBC_BLK(0, 0, 0, 28),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 28 */
    kTRDC_CMPT_MBC_FREQME            = TRDC_MBC_BLK(0, 0, 0, 29),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 29 */
    kTRDC_CMPT_MBC_FREQME_MUX        = TRDC_MBC_BLK(0, 0, 0, 30),   /*!< CMPT_TRDC MBC0 Slave 0 Block Idx 30 */

    // CMPT_TRDC.MBC[0][1], trdcInst = 0, mbcInst = 0, slvIdx = 1
    kTRDC_CMPT_MBC_NIC_GPV           = TRDC_MBC_BLK(0, 0, 1, 0),    /*!< CMPT_TRDC MBC0 Slave 1 Block Idx 0 */
    
    // MAIN_MBC0_0, trdcInst = 1, mbcInst = 0, slvIdx = 0
    kTRDC_MAIN_MBC_MODCON            = TRDC_MBC_BLK(1, 0, 0, 0),    /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 0 */
    kTRDC_MAIN_MBC_MTR               = TRDC_MBC_BLK(1, 0, 0, 2),    /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 2 */
    kTRDC_MAIN_MBC_TCU               = TRDC_MBC_BLK(1, 0, 0, 3),    /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 3 */
    kTRDC_MAIN_MBC_TRDC_MGR          = TRDC_MBC_BLK(1, 0, 0, 4),    /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 4 */
    kTRDC_MAIN_MBC_TRDC_MC           = TRDC_MBC_BLK(1, 0, 0, 5),    /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 5 */
    kTRDC_MAIN_MBC_CCM               = TRDC_MBC_BLK(1, 0, 0, 6),    /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 6 */
    kTRDC_MAIN_MBC_AHB_SRAMC         = TRDC_MBC_BLK(1, 0, 0, 8),    /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 8 */
    kTRDC_MAIN_MBC_AXBS              = TRDC_MBC_BLK(1, 0, 0, 9),    /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 9 */
    kTRDC_MAIN_MBC_XBIC              = TRDC_MBC_BLK(1, 0, 0, 12),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 12 */
    kTRDC_MAIN_MBC_XBIC_TDBG         = TRDC_MBC_BLK(1, 0, 0, 13),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 13 */
    kTRDC_MAIN_MBC_EDMA3             = TRDC_MBC_BLK(1, 0, 0, 14),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 14 */
    kTRDC_MAIN_MBC_eDMA3_TCD0        = TRDC_MBC_BLK(1, 0, 0, 15),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 15 */
    kTRDC_MAIN_MBC_eDMA3_TCD1        = TRDC_MBC_BLK(1, 0, 0, 16),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 16 */
    kTRDC_MAIN_MBC_eDMA3_TCD2        = TRDC_MBC_BLK(1, 0, 0, 17),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 17 */
    kTRDC_MAIN_MBC_eDMA3_TCD3        = TRDC_MBC_BLK(1, 0, 0, 18),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 18 */
    kTRDC_MAIN_MBC_eDMA3_TCD4        = TRDC_MBC_BLK(1, 0, 0, 19),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 19 */
    kTRDC_MAIN_MBC_eDMA3_TCD5        = TRDC_MBC_BLK(1, 0, 0, 20),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 20 */
    kTRDC_MAIN_MBC_eDMA3_TCD6        = TRDC_MBC_BLK(1, 0, 0, 21),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 21 */
    kTRDC_MAIN_MBC_eDMA3_TCD7        = TRDC_MBC_BLK(1, 0, 0, 22),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 22 */
    kTRDC_MAIN_MBC_eDMA3_TCD8        = TRDC_MBC_BLK(1, 0, 0, 23),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 23 */
    kTRDC_MAIN_MBC_eDMA3_TCD9        = TRDC_MBC_BLK(1, 0, 0, 24),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 24 */
    kTRDC_MAIN_MBC_eDMA3_TCD10       = TRDC_MBC_BLK(1, 0, 0, 25),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 25 */
    kTRDC_MAIN_MBC_eDMA3_TCD11       = TRDC_MBC_BLK(1, 0, 0, 26),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 26 */
    kTRDC_MAIN_MBC_eDMA3_TCD12       = TRDC_MBC_BLK(1, 0, 0, 27),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 27 */
    kTRDC_MAIN_MBC_eDMA3_TCD13       = TRDC_MBC_BLK(1, 0, 0, 28),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 28 */
    kTRDC_MAIN_MBC_eDMA3_TCD14       = TRDC_MBC_BLK(1, 0, 0, 29),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 29 */
    kTRDC_MAIN_MBC_eDMA3_TCD15       = TRDC_MBC_BLK(1, 0, 0, 30),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 30 */
    kTRDC_MAIN_MBC_eDMA3_TCD16       = TRDC_MBC_BLK(1, 0, 0, 31),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 31 */
    kTRDC_MAIN_MBC_eDMA3_TCD17       = TRDC_MBC_BLK(1, 0, 0, 32),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 32 */
    kTRDC_MAIN_MBC_eDMA3_TCD18       = TRDC_MBC_BLK(1, 0, 0, 33),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 33 */
    kTRDC_MAIN_MBC_eDMA3_TCD19       = TRDC_MBC_BLK(1, 0, 0, 34),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 34 */
    kTRDC_MAIN_MBC_eDMA3_TCD20       = TRDC_MBC_BLK(1, 0, 0, 35),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 35 */
    kTRDC_MAIN_MBC_eDMA3_TCD21       = TRDC_MBC_BLK(1, 0, 0, 36),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 36 */
    kTRDC_MAIN_MBC_eDMA3_TCD22       = TRDC_MBC_BLK(1, 0, 0, 37),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 37 */
    kTRDC_MAIN_MBC_eDMA3_TCD23       = TRDC_MBC_BLK(1, 0, 0, 38),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 38 */
    kTRDC_MAIN_MBC_eDMA3_TCD24       = TRDC_MBC_BLK(1, 0, 0, 39),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 39 */
    kTRDC_MAIN_MBC_eDMA3_TCD25       = TRDC_MBC_BLK(1, 0, 0, 40),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 40 */
    kTRDC_MAIN_MBC_eDMA3_TCD26       = TRDC_MBC_BLK(1, 0, 0, 41),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 41 */
    kTRDC_MAIN_MBC_eDMA3_TCD27       = TRDC_MBC_BLK(1, 0, 0, 42),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 42 */
    kTRDC_MAIN_MBC_eDMA3_TCD28       = TRDC_MBC_BLK(1, 0, 0, 43),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 43 */
    kTRDC_MAIN_MBC_eDMA3_TCD29       = TRDC_MBC_BLK(1, 0, 0, 44),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 44 */
    kTRDC_MAIN_MBC_eDMA3_TCD30       = TRDC_MBC_BLK(1, 0, 0, 45),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 45 */
    kTRDC_MAIN_MBC_eDMA3_TCD31       = TRDC_MBC_BLK(1, 0, 0, 46),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 46 */
    kTRDC_MAIN_MBC_EDMA5             = TRDC_MBC_BLK(1, 0, 0, 48),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 48 */
    kTRDC_MAIN_MBC_eDMA5_TCD0        = TRDC_MBC_BLK(1, 0, 0, 49),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 49 */
    kTRDC_MAIN_MBC_eDMA5_TCD1        = TRDC_MBC_BLK(1, 0, 0, 50),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 50 */
    kTRDC_MAIN_MBC_eDMA5_TCD2        = TRDC_MBC_BLK(1, 0, 0, 51),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 51 */
    kTRDC_MAIN_MBC_eDMA5_TCD3        = TRDC_MBC_BLK(1, 0, 0, 52),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 52 */
    kTRDC_MAIN_MBC_eDMA5_TCD4        = TRDC_MBC_BLK(1, 0, 0, 53),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 53 */
    kTRDC_MAIN_MBC_eDMA5_TCD5        = TRDC_MBC_BLK(1, 0, 0, 54),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 54 */
    kTRDC_MAIN_MBC_eDMA5_TCD6        = TRDC_MBC_BLK(1, 0, 0, 55),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 55 */
    kTRDC_MAIN_MBC_eDMA5_TCD7        = TRDC_MBC_BLK(1, 0, 0, 56),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 56 */
    kTRDC_MAIN_MBC_eDMA5_TCD8        = TRDC_MBC_BLK(1, 0, 0, 57),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 57 */
    kTRDC_MAIN_MBC_eDMA5_TCD9        = TRDC_MBC_BLK(1, 0, 0, 58),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 58 */
    kTRDC_MAIN_MBC_eDMA5_TCD10       = TRDC_MBC_BLK(1, 0, 0, 59),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 59 */
    kTRDC_MAIN_MBC_eDMA5_TCD11       = TRDC_MBC_BLK(1, 0, 0, 60),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 60 */
    kTRDC_MAIN_MBC_eDMA5_TCD12       = TRDC_MBC_BLK(1, 0, 0, 61),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 61 */
    kTRDC_MAIN_MBC_eDMA5_TCD13       = TRDC_MBC_BLK(1, 0, 0, 62),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 62 */
    kTRDC_MAIN_MBC_eDMA5_TCD14       = TRDC_MBC_BLK(1, 0, 0, 63),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 63 */
    kTRDC_MAIN_MBC_eDMA5_TCD15       = TRDC_MBC_BLK(1, 0, 0, 64),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 64 */
    kTRDC_MAIN_MBC_FREQME            = TRDC_MBC_BLK(1, 0, 0, 65),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 65 */
    kTRDC_MAIN_MBC_FREQME_MUX        = TRDC_MBC_BLK(1, 0, 0, 66),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 66 */
    kTRDC_MAIN_MBC_XECC0             = TRDC_MBC_BLK(1, 0, 0, 67),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 67 */
    kTRDC_MAIN_MBC_XECC1             = TRDC_MBC_BLK(1, 0, 0, 68),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 68 */
    kTRDC_MAIN_MBC_XECC2             = TRDC_MBC_BLK(1, 0, 0, 69),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 69 */
    kTRDC_MAIN_MBC_XSPI0             = TRDC_MBC_BLK(1, 0, 0, 70),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 70 */
    kTRDC_MAIN_MBC_XSPI1             = TRDC_MBC_BLK(1, 0, 0, 71),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 71 */
    kTRDC_MAIN_MBC_XSPI2             = TRDC_MBC_BLK(1, 0, 0, 72),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 72 */
    kTRDC_MAIN_MBC_MMU0              = TRDC_MBC_BLK(1, 0, 0, 73),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 73 */
    kTRDC_MAIN_MBC_CP                = TRDC_MBC_BLK(1, 0, 0, 75),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 75 */
    kTRDC_MAIN_MBC_PVTM              = TRDC_MBC_BLK(1, 0, 0, 76),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 76 */
    kTRDC_MAIN_MBC_MTR_MSTR          = TRDC_MBC_BLK(1, 0, 0, 77),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 77 */
    kTRDC_MAIN_MBC_CGUANA            = TRDC_MBC_BLK(1, 0, 0, 80),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 80 */
    kTRDC_MAIN_MBC_CGUDIG            = TRDC_MBC_BLK(1, 0, 0, 81),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 81 */
    kTRDC_MAIN_MBC_PMU_CSR           = TRDC_MBC_BLK(1, 0, 0, 82),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 82 */
    kTRDC_MAIN_MBC_SYSCON_RESETCON   = TRDC_MBC_BLK(1, 0, 0, 83),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 83 */
    kTRDC_MAIN_MBC_SYSCON_POWERCON   = TRDC_MBC_BLK(1, 0, 0, 84),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 84 */
    kTRDC_MAIN_MBC_SYSCON_PDCON      = TRDC_MBC_BLK(1, 0, 0, 85),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 85 */
    kTRDC_MAIN_MBC_SYSCON_MEMCON     = TRDC_MBC_BLK(1, 0, 0, 86),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 86 */
    kTRDC_MAIN_MBC_SYSCON_MTR        = TRDC_MBC_BLK(1, 0, 0, 87),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 87 */
    kTRDC_MAIN_MBC_SYSCON_TCU        = TRDC_MBC_BLK(1, 0, 0, 88),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 88 */
    kTRDC_MAIN_MBC_SYSCON_FREQME     = TRDC_MBC_BLK(1, 0, 0, 89),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 89 */
    kTRDC_MAIN_MBC_SYSCON_FREQME_MUX = TRDC_MBC_BLK(1, 0, 0, 90),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 90 */
    kTRDC_MAIN_MBC_CSSI_FSB          = TRDC_MBC_BLK(1, 0, 0, 96),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 96 */
    kTRDC_MAIN_MBC_CSSI_MU0A         = TRDC_MBC_BLK(1, 0, 0, 97),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 97 */
    kTRDC_MAIN_MBC_CSSI_MU1A         = TRDC_MBC_BLK(1, 0, 0, 98),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 98 */
    kTRDC_MAIN_MBC_CSSI_MU2A         = TRDC_MBC_BLK(1, 0, 0, 99),   /*!< MAIN_TRDC MBC0 Slave 0 Block Idx 99 */

