zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_trdc_soc.h
    // MAIN_TRDC.MBC[0][1], trdcInst = 1, mbcInst = 0, slvIdx = 1
    kTRDC_MAIN_MBC_NIC_GPV           = TRDC_MBC_BLK(1, 0, 1, 0),    /*!< MAIN_TRDC MBC0 Slave 1 Block Idx 0 */

    // MAIN_TRDC.MBC[0][2], trdcInst = 1, mbcInst = 0, slvIdx = 2
    kTRDC_MAIN_MBC_DBGMB             = TRDC_MBC_BLK(1, 0, 2, 0),    /*!< MAIN_TRDC MBC0 Slave 2 Block Idx 0 */

    // MAIN_TRDC.MBC[0][3], trdcInst = 1, mbcInst = 0, slvIdx = 3
    kTRDC_MAIN_MBC_CORESIGHT         = TRDC_MBC_BLK(1, 0, 3, 0),

    // MAIN_TRDC.MBC[1][0], trdcInst = 1, mbcInst = 1, slvIdx = 0
    kTRDC_MAIN_MBC_HSP_EVTG0         = TRDC_MBC_BLK(1, 1, 0, 0),    /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 0 */
    kTRDC_MAIN_MBC_HSP_EVTG1         = TRDC_MBC_BLK(1, 1, 0, 1),    /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 1 */
    kTRDC_MAIN_MBC_HSP_MUA0          = TRDC_MBC_BLK(1, 1, 0, 2),    /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 2 */
    kTRDC_MAIN_MBC_HSP_MUB0          = TRDC_MBC_BLK(1, 1, 0, 3),    /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 3 */
    kTRDC_MAIN_MBC_HSP_SEMA42        = TRDC_MBC_BLK(1, 1, 0, 4),    /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 4 */
    kTRDC_MAIN_MBC_HSP_ADC0          = TRDC_MBC_BLK(1, 1, 0, 5),    /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 5 */
    kTRDC_MAIN_MBC_HSP_DAC           = TRDC_MBC_BLK(1, 1, 0, 6),    /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 6 */
    kTRDC_MAIN_MBC_HSP_LPIT0         = TRDC_MBC_BLK(1, 1, 0, 7),    /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 7 */
    kTRDC_MAIN_MBC_HSP_EFLEXPWM0     = TRDC_MBC_BLK(1, 1, 0, 8),    /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 8 */
    kTRDC_MAIN_MBC_HSP_EFLEXPWM1     = TRDC_MBC_BLK(1, 1, 0, 9),    /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 9 */
    kTRDC_MAIN_MBC_HSP_QUADTPM       = TRDC_MBC_BLK(1, 1, 0, 10),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 10 */
    kTRDC_MAIN_MBC_HSP_QUADTPM1      = TRDC_MBC_BLK(1, 1, 0, 11),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 11 */
    kTRDC_MAIN_MBC_HSP_QDEC0         = TRDC_MBC_BLK(1, 1, 0, 12),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 12 */
    kTRDC_MAIN_MBC_HSP_QDEC1         = TRDC_MBC_BLK(1, 1, 0, 13),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 13 */
    kTRDC_MAIN_MBC_HSP_SINC0         = TRDC_MBC_BLK(1, 1, 0, 14),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 14 */
    kTRDC_MAIN_MBC_HSP_FLEXCAN0      = TRDC_MBC_BLK(1, 1, 0, 15),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 15 */
    kTRDC_MAIN_MBC_HSP_FLEXCAN1      = TRDC_MBC_BLK(1, 1, 0, 16),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 16 */
    kTRDC_MAIN_MBC_HSP_FlexIO0       = TRDC_MBC_BLK(1, 1, 0, 17),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 17 */
    kTRDC_MAIN_MBC_HSP_FlexIO1       = TRDC_MBC_BLK(1, 1, 0, 18),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 18 */
    kTRDC_MAIN_MBC_HSP_I3C           = TRDC_MBC_BLK(1, 1, 0, 19),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 19 */
    kTRDC_MAIN_MBC_HSP_LPI2C0        = TRDC_MBC_BLK(1, 1, 0, 20),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 20 */
    kTRDC_MAIN_MBC_WAKE_LPI2C2       = TRDC_MBC_BLK(1, 1, 0, 21),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 21 */
    kTRDC_MAIN_MBC_HSP_LPSPI0        = TRDC_MBC_BLK(1, 1, 0, 22),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 22 */
    kTRDC_MAIN_MBC_HSP_LPSPI1        = TRDC_MBC_BLK(1, 1, 0, 23),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 23 */
    kTRDC_MAIN_MBC_HSP_LPSPI2        = TRDC_MBC_BLK(1, 1, 0, 24),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 24 */
    kTRDC_MAIN_MBC_HSP_LPUART0       = TRDC_MBC_BLK(1, 1, 0, 25),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 25 */
    kTRDC_MAIN_MBC_HSP_LPUART1       = TRDC_MBC_BLK(1, 1, 0, 26),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 26 */
    kTRDC_MAIN_MBC_HSP_LPUART2       = TRDC_MBC_BLK(1, 1, 0, 27),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 27 */
    kTRDC_MAIN_MBC_HSP_IOMUXC        = TRDC_MBC_BLK(1, 1, 0, 28),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 28 */
    kTRDC_MAIN_MBC_HSP_QTIMER0       = TRDC_MBC_BLK(1, 1, 0, 30),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 30 */
    kTRDC_MAIN_MBC_HSP_QTIMER1       = TRDC_MBC_BLK(1, 1, 0, 31),   /*!< MAIN_TRDC MBC1 Slave 0 Block Idx 31 */

    // MAIN_TRDC.MBC[1][1], trdcInst = 1, mbcInst = 1, slvIdx = 1
    kTRDC_MAIN_MBC_HSP_EVTG2         = TRDC_MBC_BLK(1, 1, 1, 0),    /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 0 */
    kTRDC_MAIN_MBC_HSP_EVTG3         = TRDC_MBC_BLK(1, 1, 1, 1),    /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 1 */
    kTRDC_MAIN_MBC_HSP_XBAR0         = TRDC_MBC_BLK(1, 1, 1, 2),    /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 2 */
    kTRDC_MAIN_MBC_HSP_XBAR1         = TRDC_MBC_BLK(1, 1, 1, 3),    /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 3 */
    kTRDC_MAIN_MBC_HSP_XBAR2         = TRDC_MBC_BLK(1, 1, 1, 4),    /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 4 */
    kTRDC_MAIN_MBC_HSP_ADC1          = TRDC_MBC_BLK(1, 1, 1, 5),    /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 5 */
    kTRDC_MAIN_MBC_HSP_LPIT1         = TRDC_MBC_BLK(1, 1, 1, 6),    /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 6 */
    kTRDC_MAIN_MBC_HSP_EFLEXPWM2     = TRDC_MBC_BLK(1, 1, 1, 7),    /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 7 */
    kTRDC_MAIN_MBC_HSP_EFLEXPWM3     = TRDC_MBC_BLK(1, 1, 1, 8),    /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 8 */
    kTRDC_MAIN_MBC_HSP_QUADTPM2      = TRDC_MBC_BLK(1, 1, 1, 9),    /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 9 */
    kTRDC_MAIN_MBC_HSP_QUADTPM3      = TRDC_MBC_BLK(1, 1, 1, 10),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 10 */
    kTRDC_MAIN_MBC_HSP_QUADTPM4      = TRDC_MBC_BLK(1, 1, 1, 11),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 11 */
    kTRDC_MAIN_MBC_HSP_QDEC2         = TRDC_MBC_BLK(1, 1, 1, 12),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 12 */
    kTRDC_MAIN_MBC_HSP_QDEC3         = TRDC_MBC_BLK(1, 1, 1, 13),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 13 */
    kTRDC_MAIN_MBC_HSP_SINC1         = TRDC_MBC_BLK(1, 1, 1, 14),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 14 */
    kTRDC_MAIN_MBC_HSP_FLEXCAN2      = TRDC_MBC_BLK(1, 1, 1, 15),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 15 */
    kTRDC_MAIN_MBC_HSP_FlexIO2       = TRDC_MBC_BLK(1, 1, 1, 16),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 16 */
    kTRDC_MAIN_MBC_HSP_LPI2C1        = TRDC_MBC_BLK(1, 1, 1, 17),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 17 */
    kTRDC_MAIN_MBC_HSP_LPI2C3        = TRDC_MBC_BLK(1, 1, 1, 18),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 18 */
    kTRDC_MAIN_MBC_HSP_LPSPI3        = TRDC_MBC_BLK(1, 1, 1, 19),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 19 */
    kTRDC_MAIN_MBC_HSP_LPSPI4        = TRDC_MBC_BLK(1, 1, 1, 20),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 20 */
    kTRDC_MAIN_MBC_HSP_LPUART3       = TRDC_MBC_BLK(1, 1, 1, 21),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 21 */
    kTRDC_MAIN_MBC_HSP_LPUART4       = TRDC_MBC_BLK(1, 1, 1, 22),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 22 */
    kTRDC_MAIN_MBC_HSP_LPUART5       = TRDC_MBC_BLK(1, 1, 1, 23),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 23 */
    kTRDC_MAIN_MBC_HSP_CRC           = TRDC_MBC_BLK(1, 1, 1, 24),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 24 */
    kTRDC_MAIN_MBC_HSP_TRGSYNC0      = TRDC_MBC_BLK(1, 1, 1, 25),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 25 */
    kTRDC_MAIN_MBC_HSP_TRGSYNC1      = TRDC_MBC_BLK(1, 1, 1, 26),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 26 */
    kTRDC_MAIN_MBC_HSP_STM           = TRDC_MBC_BLK(1, 1, 1, 27),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 27 */
    kTRDC_MAIN_MBC_HSP_QTIMER2       = TRDC_MBC_BLK(1, 1, 1, 30),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 30 */
    kTRDC_MAIN_MBC_HSP_QTIMER3       = TRDC_MBC_BLK(1, 1, 1, 31),   /*!< MAIN_TRDC MBC1 Slave 1 Block Idx 31 */

    // MAIN_TRDC.MBC[1][2], trdcInst = 1, mbcInst = 1, slvIdx = 2
    kTRDC_MAIN_MBC_GPIO0             = TRDC_MBC_BLK(1, 1, 2, 0),    /*!< MAIN_TRDC MBC1 Slave 2 Block Idx 0 */
    kTRDC_MAIN_MBC_GPIO1             = TRDC_MBC_BLK(1, 1, 2, 1),    /*!< MAIN_TRDC MBC1 Slave 2 Block Idx 1 */
    kTRDC_MAIN_MBC_GPIO2             = TRDC_MBC_BLK(1, 1, 2, 2),    /*!< MAIN_TRDC MBC1 Slave 2 Block Idx 2 */
    kTRDC_MAIN_MBC_GPIO3             = TRDC_MBC_BLK(1, 1, 2, 3),    /*!< MAIN_TRDC MBC1 Slave 2 Block Idx 3 */
    kTRDC_MAIN_MBC_GPIO4             = TRDC_MBC_BLK(1, 1, 2, 4),    /*!< MAIN_TRDC MBC1 Slave 2 Block Idx 4 */

    // COMM_MBC[0][0], trdcInst = 2, mbcInst = 0, slvIdx = 0
    kTRDC_COMM_MBC_MODCON            = TRDC_MBC_BLK(2, 0, 0, 0),    /*!< COMM_TRDC MBC0 Slave 0 Block Idx 0 */
    kTRDC_COMM_MBC_MTR               = TRDC_MBC_BLK(2, 0, 0, 2),    /*!< COMM_TRDC MBC0 Slave 0 Block Idx 2 */
    kTRDC_COMM_MBC_TCU               = TRDC_MBC_BLK(2, 0, 0, 3),    /*!< COMM_TRDC MBC0 Slave 0 Block Idx 3 */
    kTRDC_COMM_MBC_TRDC_MGR          = TRDC_MBC_BLK(2, 0, 0, 4),    /*!< COMM_TRDC MBC0 Slave 0 Block Idx 4 */
    kTRDC_COMM_MBC_TRDC_MC           = TRDC_MBC_BLK(2, 0, 0, 5),    /*!< COMM_TRDC MBC0 Slave 0 Block Idx 5 */
    kTRDC_COMM_MBC_CCM               = TRDC_MBC_BLK(2, 0, 0, 6),    /*!< COMM_TRDC MBC0 Slave 0 Block Idx 6 */
    kTRDC_COMM_MBC_uSDHC0            = TRDC_MBC_BLK(2, 0, 0, 8),    /*!< COMM_TRDC MBC0 Slave 0 Block Idx 8 */
    kTRDC_COMM_MBC_uSDHC1            = TRDC_MBC_BLK(2, 0, 0, 9),    /*!< COMM_TRDC MBC0 Slave 0 Block Idx 9 */
    kTRDC_COMM_MBC_HSUSB             = TRDC_MBC_BLK(2, 0, 0, 10),   /*!< COMM_TRDC MBC0 Slave 0 Block Idx 10 */
    kTRDC_COMM_MBC_FSUSB             = TRDC_MBC_BLK(2, 0, 0, 11),   /*!< COMM_TRDC MBC0 Slave 0 Block Idx 11 */
    kTRDC_COMM_MBC_ETH0              = TRDC_MBC_BLK(2, 0, 0, 12),   /*!< COMM_TRDC MBC0 Slave 0 Block Idx 12 */
    kTRDC_COMM_MBC_ETH1              = TRDC_MBC_BLK(2, 0, 0, 13),   /*!< COMM_TRDC MBC0 Slave 0 Block Idx 13 */
    kTRDC_COMM_MBC_xSPIR             = TRDC_MBC_BLK(2, 0, 0, 14),   /*!< COMM_TRDC MBC0 Slave 0 Block Idx 14 */
    kTRDC_COMM_MBC_USB_PHY           = TRDC_MBC_BLK(2, 0, 0, 15),   /*!< COMM_TRDC MBC0 Slave 0 Block Idx 15 */
    kTRDC_COMM_MBC_XENO_PHY0         = TRDC_MBC_BLK(2, 0, 0, 16),   /*!< COMM_TRDC MBC0 Slave 0 Block Idx 16 */
    kTRDC_COMM_MBC_XENO_PHY1         = TRDC_MBC_BLK(2, 0, 0, 17),   /*!< COMM_TRDC MBC0 Slave 0 Block Idx 17 */
    kTRDC_COMM_MBC_FREQME            = TRDC_MBC_BLK(2, 0, 0, 18),   /*!< COMM_TRDC MBC0 Slave 0 Block Idx 18 */
    kTRDC_COMM_MBC_FREQME_MUX        = TRDC_MBC_BLK(2, 0, 0, 19),   /*!< COMM_TRDC MBC0 Slave 0 Block Idx 19 */

