zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT2660/MIMXRT2663/drivers/fsl_trdc_soc.h
    // COMM_TRDC.MBC[0][1], trdcInst = 2, mbcInst = 0, slvIdx = 1
    kTRDC_COMM_MBC_NIC_GPV           = TRDC_MBC_BLK(2, 0, 1, 0),    /*!< COMM_TRDC MBC0 Slave 1 Block Idx 0 */
    
    // AUDIO_MBC[0][0], trdcInst = 3, mbcInst = 0, slvIdx = 0
    kTRDC_AUDIO_MBC_MODCON           = TRDC_MBC_BLK(3, 0, 0, 0),    /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 0 */
    kTRDC_AUDIO_MBC_MTR              = TRDC_MBC_BLK(3, 0, 0, 2),    /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 2 */
    kTRDC_AUDIO_MBC_TCU              = TRDC_MBC_BLK(3, 0, 0, 3),    /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 3 */
    kTRDC_AUDIO_MBC_TRDC_MGR         = TRDC_MBC_BLK(3, 0, 0, 4),    /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 4 */
    kTRDC_AUDIO_MBC_TRDC_MC          = TRDC_MBC_BLK(3, 0, 0, 5),    /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 5 */
    kTRDC_AUDIO_MBC_CCM              = TRDC_MBC_BLK(3, 0, 0, 6),    /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 6 */
    kTRDC_AUDIO_MBC_SLEEPCON         = TRDC_MBC_BLK(3, 0, 0, 7),    /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 7 */
    kTRDC_AUDIO_MBC_DMIC             = TRDC_MBC_BLK(3, 0, 0, 8),    /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 8 */
    kTRDC_AUDIO_MBC_FREQME           = TRDC_MBC_BLK(3, 0, 0, 9),    /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 9 */
    kTRDC_AUDIO_MBC_FREQME_MUX       = TRDC_MBC_BLK(3, 0, 0, 10),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 10 */
    kTRDC_AUDIO_MBC_LPIT             = TRDC_MBC_BLK(3, 0, 0, 11),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 11 */
    kTRDC_AUDIO_MBC_SAI0             = TRDC_MBC_BLK(3, 0, 0, 12),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 12 */
    kTRDC_AUDIO_MBC_SAI1             = TRDC_MBC_BLK(3, 0, 0, 13),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 13 */
    kTRDC_AUDIO_MBC_SAI2             = TRDC_MBC_BLK(3, 0, 0, 14),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 14 */
    kTRDC_AUDIO_MBC_SAI3             = TRDC_MBC_BLK(3, 0, 0, 15),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 15 */
    kTRDC_AUDIO_MBC_SAI4             = TRDC_MBC_BLK(3, 0, 0, 16),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 16 */
    kTRDC_AUDIO_MBC_SAI5             = TRDC_MBC_BLK(3, 0, 0, 17),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 17 */
    kTRDC_AUDIO_MBC_SAI6             = TRDC_MBC_BLK(3, 0, 0, 18),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 18 */
    kTRDC_AUDIO_MBC_SAI7             = TRDC_MBC_BLK(3, 0, 0, 19),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 19 */
    kTRDC_AUDIO_MBC_ASRC             = TRDC_MBC_BLK(3, 0, 0, 20),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 20 */
    kTRDC_AUDIO_MBC_XBAR             = TRDC_MBC_BLK(3, 0, 0, 22),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 22 */
    kTRDC_AUDIO_MBC_EDMA3            = TRDC_MBC_BLK(3, 0, 0, 23),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 23 */
    kTRDC_AUDIO_MBC_eDMA3_TCD0       = TRDC_MBC_BLK(3, 0, 0, 24),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 24 */
    kTRDC_AUDIO_MBC_eDMA3_TCD1       = TRDC_MBC_BLK(3, 0, 0, 25),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 25 */
    kTRDC_AUDIO_MBC_eDMA3_TCD2       = TRDC_MBC_BLK(3, 0, 0, 26),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 26 */
    kTRDC_AUDIO_MBC_eDMA3_TCD3       = TRDC_MBC_BLK(3, 0, 0, 27),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 27 */
    kTRDC_AUDIO_MBC_eDMA3_TCD4       = TRDC_MBC_BLK(3, 0, 0, 28),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 28 */
    kTRDC_AUDIO_MBC_eDMA3_TCD5       = TRDC_MBC_BLK(3, 0, 0, 29),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 29 */
    kTRDC_AUDIO_MBC_eDMA3_TCD6       = TRDC_MBC_BLK(3, 0, 0, 30),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 30 */
    kTRDC_AUDIO_MBC_eDMA3_TCD7       = TRDC_MBC_BLK(3, 0, 0, 31),   /*!< AUDIO_TRDC MBC0 Slave 0 Block Idx 31 */

    // AUDIO_TRDC.MBC[0][1], trdcInst = 3, mbcInst = 0, slvIdx = 1
    kTRDC_AUDIO_MBC_SPIDF            = TRDC_MBC_BLK(3, 0, 1, 0),    /*!< AUDIO_TRDC MBC0 Slave 1 Block Idx 0 */

    // AUDIO_TRDC.MBC[0][2], trdcInst = 3, mbcInst = 0, slvIdx = 2
    kTRDC_AUDIO_MBC_SRAM0            = TRDC_MBC_BLK(3, 0, 2, 0),    /*!< AUDIO_TRDC MBC0 Slave 2 Block Idx 0 */
    kTRDC_AUDIO_MBC_SRAM1            = TRDC_MBC_BLK(3, 0, 2, 1),    /*!< AUDIO_TRDC MBC0 Slave 2 Block Idx 1 */

    // MEDIA_MBC[0][0], trdcInst = 4, mbcInst = 0, slvIdx = 0
    kTRDC_MEDIA_MBC_MODCON           = TRDC_MBC_BLK(4, 0, 0, 0),    /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 0 */
    kTRDC_MEDIA_MBC_MTR              = TRDC_MBC_BLK(4, 0, 0, 2),    /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 2 */
    kTRDC_MEDIA_MBC_TCU              = TRDC_MBC_BLK(4, 0, 0, 3),    /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 3 */
    kTRDC_MEDIA_MBC_TRDC_MGR         = TRDC_MBC_BLK(4, 0, 0, 4),    /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 4 */
    kTRDC_MEDIA_MBC_TRDC_MC          = TRDC_MBC_BLK(4, 0, 0, 5),    /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 5 */
    kTRDC_MEDIA_MBC_CCM              = TRDC_MBC_BLK(4, 0, 0, 6),    /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 6 */
    kTRDC_MEDIA_MBC_CSI              = TRDC_MBC_BLK(4, 0, 0, 9),    /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 9 */
    kTRDC_MEDIA_MBC_DSI_REG          = TRDC_MBC_BLK(4, 0, 0, 10),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 10 */
    kTRDC_MEDIA_MBC_CSI_REG          = TRDC_MBC_BLK(4, 0, 0, 11),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 11 */
    kTRDC_MEDIA_MBC_JPEGDEC          = TRDC_MBC_BLK(4, 0, 0, 12),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 12 */
    kTRDC_MEDIA_MBC_PNGDEC           = TRDC_MBC_BLK(4, 0, 0, 13),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 13 */
    kTRDC_MEDIA_MBC_TINGPU           = TRDC_MBC_BLK(4, 0, 0, 14),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 14 */
    kTRDC_MEDIA_MBC_VIDEOMUX         = TRDC_MBC_BLK(4, 0, 0, 15),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 15 */
    kTRDC_MEDIA_MBC_FREQME           = TRDC_MBC_BLK(4, 0, 0, 16),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 16 */
    kTRDC_MEDIA_MBC_FREQME_MUX       = TRDC_MBC_BLK(4, 0, 0, 17),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 17 */
    kTRDC_MEDIA_MBC_ISI0             = TRDC_MBC_BLK(4, 0, 0, 18),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 18 */
    kTRDC_MEDIA_MBC_ISI1             = TRDC_MBC_BLK(4, 0, 0, 19),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 19 */
    kTRDC_MEDIA_MBC_MIPI_DSI_PHY     = TRDC_MBC_BLK(4, 0, 0, 22),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 22 */
    kTRDC_MEDIA_MBC_DCIF0            = TRDC_MBC_BLK(4, 0, 0, 32),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 32 */
    kTRDC_MEDIA_MBC_DCIF1            = TRDC_MBC_BLK(4, 0, 0, 33),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 33 */
    kTRDC_MEDIA_MBC_DCIF2            = TRDC_MBC_BLK(4, 0, 0, 34),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 34 */
    kTRDC_MEDIA_MBC_DCIF3            = TRDC_MBC_BLK(4, 0, 0, 35),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 35 */
    kTRDC_MEDIA_MBC_DCIF4            = TRDC_MBC_BLK(4, 0, 0, 36),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 36 */
    kTRDC_MEDIA_MBC_DCIF5            = TRDC_MBC_BLK(4, 0, 0, 37),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 37 */
    kTRDC_MEDIA_MBC_DCIF6            = TRDC_MBC_BLK(4, 0, 0, 38),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 38 */
    kTRDC_MEDIA_MBC_DCIF7            = TRDC_MBC_BLK(4, 0, 0, 39),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 39 */
    kTRDC_MEDIA_MBC_DCIF8            = TRDC_MBC_BLK(4, 0, 0, 40),   /*!< MEDIA_TRDC MBC0 Slave 0 Block Idx 40 */

    // MEDIA_TRDC.MBC[0][1], trdcInst = 4, mbcInst = 0, slvIdx = 1
    kTRDC_MEDIA_MBC_NIC_GPV          = TRDC_MBC_BLK(4, 0, 1, 0),    /*!< MEDIA_TRDC MBC0 Slave 1 Block Idx 0 */

    // MEDIA_TRDC.MBC[0][2], trdcInst = 4, mbcInst = 0, slvIdx = 2
    kTRDC_MEDIA_MBC_GPU_AHB          = TRDC_MBC_BLK(4, 0, 2, 0),    /*!< MEDIA_TRDC MBC0 Slave 2 Block Idx 0 */

    // WAKE_TRDC.MBC[0][0], trdcInst = 5, mbcInst = 0, slvIdx = 0
    kTRDC_WAKE_MBC_MODCON            = TRDC_MBC_BLK(5, 0, 0, 0),    /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 0 */
    kTRDC_WAKE_MBC_MTR               = TRDC_MBC_BLK(5, 0, 0, 2),    /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 2 */
    kTRDC_WAKE_MBC_TCU               = TRDC_MBC_BLK(5, 0, 0, 3),    /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 3 */
    kTRDC_WAKE_MBC_TRDC_MGR          = TRDC_MBC_BLK(5, 0, 0, 4),    /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 4 */
    kTRDC_WAKE_MBC_TRDC_MC           = TRDC_MBC_BLK(5, 0, 0, 5),    /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 5 */
    kTRDC_WAKE_MBC_CCM               = TRDC_MBC_BLK(5, 0, 0, 6),    /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 6 */
    kTRDC_WAKE_MBC_FREQME            = TRDC_MBC_BLK(5, 0, 0, 8),    /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 8 */
    kTRDC_WAKE_MBC_FREQME_MUX        = TRDC_MBC_BLK(5, 0, 0, 9),    /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 9 */
    kTRDC_WAKE_MBC_DMIC              = TRDC_MBC_BLK(5, 0, 0, 10),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 10 */
    kTRDC_WAKE_MBC_XBAR              = TRDC_MBC_BLK(5, 0, 0, 11),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 11 */
    kTRDC_WAKE_MBC_TRGSYNC           = TRDC_MBC_BLK(5, 0, 0, 12),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 12 */
    kTRDC_WAKE_MBC_CMP0              = TRDC_MBC_BLK(5, 0, 0, 13),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 13 */
    kTRDC_WAKE_MBC_CMP1              = TRDC_MBC_BLK(5, 0, 0, 14),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 14 */
    kTRDC_WAKE_MBC_CMP2              = TRDC_MBC_BLK(5, 0, 0, 15),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 15 */
    kTRDC_WAKE_MBC_CMP3              = TRDC_MBC_BLK(5, 0, 0, 16),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 16 */
    kTRDC_WAKE_MBC_EWM               = TRDC_MBC_BLK(5, 0, 0, 17),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 17 */
    kTRDC_WAKE_MBC_LPTMR0            = TRDC_MBC_BLK(5, 0, 0, 19),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 19 */
    kTRDC_WAKE_MBC_LPTMR1            = TRDC_MBC_BLK(5, 0, 0, 20),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 20 */
    kTRDC_WAKE_MBC_QUADTPM           = TRDC_MBC_BLK(5, 0, 0, 21),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 21 */
    kTRDC_WAKE_MBC_SWT0              = TRDC_MBC_BLK(5, 0, 0, 22),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 22 */
    kTRDC_WAKE_MBC_SWT1              = TRDC_MBC_BLK(5, 0, 0, 23),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 23 */
    kTRDC_WAKE_MBC_SWT2              = TRDC_MBC_BLK(5, 0, 0, 24),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 24 */
    kTRDC_WAKE_MBC_SWT3              = TRDC_MBC_BLK(5, 0, 0, 25),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 25 */
    kTRDC_WAKE_MBC_SYS_CTR           = TRDC_MBC_BLK(5, 0, 0, 26),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 26 */
    kTRDC_WAKE_MBC_I3C               = TRDC_MBC_BLK(5, 0, 0, 27),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 27 */
    kTRDC_WAKE_MBC_LPI2C0            = TRDC_MBC_BLK(5, 0, 0, 28),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 28 */
    kTRDC_WAKE_MBC_LPI2C1            = TRDC_MBC_BLK(5, 0, 0, 29),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 29 */
    kTRDC_WAKE_MBC_LPSPI             = TRDC_MBC_BLK(5, 0, 0, 30),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 30 */
    kTRDC_WAKE_MBC_LPUART0           = TRDC_MBC_BLK(5, 0, 0, 31),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 31 */
    kTRDC_WAKE_MBC_LPUART1           = TRDC_MBC_BLK(5, 0, 0, 32),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 32 */
    kTRDC_WAKE_MBC_RGPIO             = TRDC_MBC_BLK(5, 0, 0, 33),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 33 */
    kTRDC_WAKE_MBC_IOMUXC            = TRDC_MBC_BLK(5, 0, 0, 34),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 34 */
    kTRDC_WAKE_MBC_TSI               = TRDC_MBC_BLK(5, 0, 0, 35),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 35 */
    kTRDC_WAKE_MBC_EDMA3             = TRDC_MBC_BLK(5, 0, 0, 39),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 39 */
    kTRDC_WAKE_MBC_eDMA3_TCD0        = TRDC_MBC_BLK(5, 0, 0, 40),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 40 */
    kTRDC_WAKE_MBC_eDMA3_TCD1        = TRDC_MBC_BLK(5, 0, 0, 41),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 41 */
    kTRDC_WAKE_MBC_eDMA3_TCD2        = TRDC_MBC_BLK(5, 0, 0, 42),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 42 */
    kTRDC_WAKE_MBC_eDMA3_TCD3        = TRDC_MBC_BLK(5, 0, 0, 43),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 43 */
    kTRDC_WAKE_MBC_eDMA3_TCD4        = TRDC_MBC_BLK(5, 0, 0, 44),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 44 */
    kTRDC_WAKE_MBC_eDMA3_TCD5        = TRDC_MBC_BLK(5, 0, 0, 45),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 45 */
    kTRDC_WAKE_MBC_eDMA3_TCD6        = TRDC_MBC_BLK(5, 0, 0, 46),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 46 */
    kTRDC_WAKE_MBC_eDMA3_TCD7        = TRDC_MBC_BLK(5, 0, 0, 47),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 47 */
    kTRDC_WAKE_MBC_VBAT_SRAM         = TRDC_MBC_BLK(5, 0, 0, 48),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 48 */
    kTRDC_WAKE_MBC_VBAT_MTR          = TRDC_MBC_BLK(5, 0, 0, 49),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 49 */
    kTRDC_WAKE_MBC_VBAT_TDET         = TRDC_MBC_BLK(5, 0, 0, 50),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 50 */
    kTRDC_WAKE_MBC_VBAT_LPTMR        = TRDC_MBC_BLK(5, 0, 0, 51),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 51 */
    kTRDC_WAKE_MBC_VBAT_RTC          = TRDC_MBC_BLK(5, 0, 0, 52),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 52 */
    kTRDC_WAKE_MBC_VBAT_RGPIO        = TRDC_MBC_BLK(5, 0, 0, 53),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 53 */
    kTRDC_WAKE_MBC_VBAT_IOMUXC       = TRDC_MBC_BLK(5, 0, 0, 54),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 54 */
    kTRDC_WAKE_MBC_VBAT_VBATCON      = TRDC_MBC_BLK(5, 0, 0, 55),   /*!< WAKE_TRDC MBC0 Slave 0 Block Idx 55 */

    // WAKE_TRDC.MBC[0][1], trdcInst = 5, mbcInst = 0, slvIdx = 1
    kTRDC_WAKE_MBC_SRAM0             = TRDC_MBC_BLK(5, 0, 1, 0),    /*!< WAKE_TRDC MBC0 Slave 1 Block Idx 0 */
    kTRDC_WAKE_MBC_SRAM1             = TRDC_MBC_BLK(5, 0, 1, 1),    /*!< WAKE_TRDC MBC0 Slave 1 Block Idx 1 */
} trdc_mbc_block_t;

/* @} */

/*!@brief TRDC base address convert macro */
#define TRDC_GENERAL_OFFSET           0UL
#define TRDC_FLW_OFFSET               0x1E0UL
#define TRDC_DOMAIN_ERROR_OFFSET      0x1FCUL
#define TRDC_DOMAIN_ASSIGNMENT_OFFSET 0x700UL
#define TRDC_MBC_OFFSET(x)            0x10000UL /* Different TRDC instance may have different offset. */
#define TRDC_MBC_ARRAY_STEP           0x1000UL
#define TRDC_MRC_OFFSET(x)            (((x) == (void *)CMPT__TRDC) ? (0x11000UL) : (((x) == (void *)MAIN__TRDC) ? (0x12000UL) : 0U))
#define TRDC_MRC_ARRAY_STEP           0x800UL

/*!@brief Some macros are only defined for TRDC_SOC*/
#define TRDC_MDA_W_DFMT1_LK1(x)                  (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT1_LK1_SHIFT)) & TRDC_MDA_W_DFMT1_LK1_MASK)

#define TRDC_MDA_W_DFMT0_LK1_MASK                (0x40000000U)
#define TRDC_MDA_W_DFMT0_LK1_SHIFT               (30U)
/*! LK1 - 1-bit Lock
 *  0b0..Register can be written by any secure privileged write.
 *  0b1..Register is locked (read-only) until the next reset.
 */
#define TRDC_MDA_W_DFMT0_LK1(x)                  (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT1_LK1_SHIFT)) & TRDC_MDA_W_DFMT1_LK1_MASK)



#define TRDC_MDA_W_DFMT0_VLD_MASK                (0x80000000U)
#define TRDC_MDA_W_DFMT0_VLD_SHIFT               (31U)
/*! VLD - Valid
 *  0b0..The Wr domain assignment is invalid.
 *  0b1..The Wr domain assignment is valid.
 */
#define TRDC_MDA_W_DFMT0_VLD(x)                  (((uint32_t)(((uint32_t)(x)) << TRDC_MDA_W_DFMT1_VLD_SHIFT)) & TRDC_MDA_W_DFMT1_VLD_MASK)

/*******************************************************************************
 * API
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif

#ifdef __cplusplus
}
#endif

/*!
 * @}
 */

#endif /* _FSL_TRDC_SOC_H_ */
